{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"args_0_1:0": {"name": "args_0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}, "args_0_2:0": {"name": "args_0_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}, "args_0:0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}}, "outputs": {"identity": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/activation_3/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/activation_3/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/keras_multi_head_attention_3/multi_head_attention_3/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/keras_multi_head_attention_3/multi_head_attention_3/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/keras_multi_head_attention_3/multi_head_attention_3/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/activation_2/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/activation_2/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/keras_multi_head_attention_2/multi_head_attention_2/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/keras_multi_head_attention_2/multi_head_attention_2/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/keras_multi_head_attention_2/multi_head_attention_2/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/activation_1/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/activation_1/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/keras_multi_head_attention_1/multi_head_attention_1/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/keras_multi_head_attention_1/multi_head_attention_1/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/keras_multi_head_attention_1/multi_head_attention_1/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/activation/Gelu/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/activation/Gelu/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4096"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4096"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_3/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Shape_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization_1/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization_1/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/activation/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense_1/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense_1/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/sequential/dense_1/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_2/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_2/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_2/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_2/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/keras_multi_head_attention_1/multi_head_attention_1/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/keras_multi_head_attention_1/multi_head_attention_1/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_3/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_3/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_3/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/layer_normalization_3/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_2/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_2/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_2/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/activation_1/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_3/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_3/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/sequential_1/dense_3/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_4/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_4/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_4/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_4/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/keras_multi_head_attention_2/multi_head_attention_2/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/keras_multi_head_attention_2/multi_head_attention_2/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_5/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_5/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_5/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/layer_normalization_5/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_4/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_4/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_4/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/activation_2/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_5/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_5/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/sequential_2/dense_5/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_2/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_6/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_6/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_6/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_6/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/keras_multi_head_attention_3/multi_head_attention_3/value/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "8"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/keras_multi_head_attention_3/multi_head_attention_3/attention_output/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_7/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_7/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_7/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/layer_normalization_7/batchnorm/mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_6/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_6/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_6/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/activation_3/Gelu/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_7/Tensordot/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_7/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/sequential_3/dense_7/Tensordot/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block_3/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose", "op": "Transpose", "input": ["args_0", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-4"}, {"size": "-5"}, {"size": "-6"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_1", "op": "Transpose", "input": ["args_0_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "-9"}, {"size": "-10"}, {"size": "-11"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_2", "op": "Transpose", "input": ["args_0_2", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_2/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-14"}, {"size": "-15"}, {"size": "-16"}, {"size": "-17"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_2", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/add_1"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": true}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/MatMul", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/MatMul_1", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/softmax/Softmax", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_2"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_3", "op": "Transpose", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/MatMul_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_3/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "4096"}, {"size": "256"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/transpose_3", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Shape_6"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_cross_attention_module/Reshape_3", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "1"}, {"size": "256"}, {"size": "64"}, {"size": "64"}]}, {"dim": [{"size": "4"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/transpose", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/SquaredDifference", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/variance", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/Rsqrt", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/moments/mean", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/Reshape", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add_1", "op": "Sub", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/key/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/key/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/query/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/query/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/value/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/layer_normalization/batchnorm/add_1", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/value/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjLGNkZS0+YWJkZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/query/einsum/Einsum", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/key/einsum/Einsum", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/Mul"], "attr": {"equation": {"s": "YWVjZCxhYmNkLT5hY2Jl"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/softmax_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/einsum/Einsum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/softmax_1/Softmax", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/value/einsum/Einsum"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWNiZSxhZWNkLT5hYmNk"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/attention_output/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/einsum_1/Einsum", "StatefulPartitionedCall/model/keras_implicit_motion_alignment/keras_transformer_block/keras_multi_head_attention/multi_head_attention/attention_output/einsum/Einsum/ReadVariableOp"], "attr": {"N": {"i": "2"}, "equation": {"s": "YWJjZCxjZGUtPmFiZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": 